[
  {
    "Team": "Team",
    "Name Surename": "Milan Rajlic",
    "Tittle": "Co-Founder & CEO",
    "Linkedin": "https://www.linkedin.com/in/milan-rajlic-a53abaa/",
    "Text": "Multi-faced professional with over 20 years of experience living, studying and working in international environments - Europe,and Ex-YU countries. His strenghts lie in deep understanding of industry, energy and infrastructure, along with strategy and business development across consulting and consumer goods marketing."
  },
  {
    "Team": "Team",
    "Name Surename": "Andrej Muzevic",
    "Tittle": "Co-Founder",
    "Linkedin": "https://www.linkedin.com/in/andrej-muzevic-075b674a",
    "Text": "Experienced Partner with a proven history of working in the investment management industry. Skilled in Business Planning, Due Diligence, Strategic Planning, Business Development, and Venture Capital. Strong professional with a Master of Science (MSc) focused in Economics from Univerza v Ljubljani."
  },
  {
    "Team": "Team",
    "Name Surename": "Marco Muhrer Schwaiger",
    "Tittle": "Consultant of the Management Board",
    "Linkedin": "https://www.linkedin.com/in/marco-muhrer-schwaiger-61913629/",
    "Text": "Over 15 years of experience in marketing, PA, PR, and business development. Special focus on the healthcare industry for the last 8 years. Frequent keynote speaker at international congresses, guest lecturer at various universities. Co-author and Co-publisher of the scientific book. Remeasurement of the Healthcare Industry. Winner of the Health Media Award."
  },
  {
    "Team": "Team",
    "Name Surename": "Achim Schuetz",
    "Tittle": "Chief Operating Officer",
    "Linkedin": "https://www.linkedin.com/in/achim-schütz-989336145/",
    "Text": "CEO and Owner of Syscoach Consulting, CEO of private hospital chain in Germany. More than 25 years of experience in healthcare and insurance sector. Publisher and author of various scientific books."
  },
  {
    "Team": "Team",
    "Name Surename": "Dr. Rolf Porsche",
    "Tittle": "Chief Visionary Officer",
    "Linkedin": "https://www.linkedin.com/in/dr-rolf-porsche-26999235/",
    "Text": "During the last 20 years, Rolf held leading positions in the Healthcare and Life Sciences practices at Arthur D. Little and IBM in Europe and the US. He also worked for many start ups as business developer and assessed more than 100 products/complete R+D portfolios in Life Sciences. Rolf is CEO of PORSCHEHEALTH, an international working advisory company executing strategic and realization support projects."
  },
  {
    "Team": "Team",
    "Name Surename": "Anja Music",
    "Tittle": "Chief Financial Officer",
    "Linkedin": "https://www.linkedin.com/in/anja-music-17541024/",
    "Text": "Young professional with more than 7 years experience in Banking and Treasury department, later as Senior Accountant in French bank which has given her strong analytical skills, understanding of business planning, financial reporting, accounting, business analysis, project management, problem solving, as well as coordination across departments."
  },
  {
    "Team": "Team",
    "Name Surename": "Matjaz Torc",
    "Tittle": "Chief Technology Officer",
    "Linkedin": "https://www.linkedin.com/in/matjaž-torč-7920b689/",
    "Text": "Always viewing out of the box when creating, using innovation and simplicity wherever possible. Analytical thinking on the other hand enables him to produce results and services with long term effect, checkpoints and repeatability."
  },
  {
    "Team": "Team",
    "Name Surename": "Joze Hudina",
    "Tittle": "Head of Blockchain Development",
    "Linkedin": "https://twitter.com/jojohudina?lang=mr",
    "Text": "He is a co-founder with more than 15 year old company that works in telecommunications industry. Almost 5 years ago he started to focus on blockchain technology. In this field, he is a co-founder of Bitins Ltd, a company that develops solutions for Bitcoin mass adoption. He is also an advisor for several blockchain projects."
  },
  {
    "Team": "Team",
    "Name Surename": "Dr. Zoran Milosevic",
    "Tittle": "Chief Digital Health Officer",
    "Linkedin": "https://www.linkedin.com/in/zorandmilosevic/",
    "Text": "An internationally recognised digital health expert with over 15 years experience at strategic and interoperability eHealth projects in Australia and USA, in variety of environments, spanning eHealth authorities, private health providers, and standard bodies. Member of the HL7 International Architecture Review Board. Research leader in digital contracts and enterprise distributed systems, with significant track record achieved while working in applied research institutions and universities in Australia and UK. Entrepreneur activities in the translation of research into product design and development, as a founding partner in the Deontik Australia. A practitioner of data analytics, machine learning, AI and blockchain. Fellow of Australian Computer Society and Senior Member of IEEE."
  },
  {
    "Team": "Team",
    "Name Surename": "Marko Wernig",
    "Tittle": "Chief Marketing Officer",
    "Linkedin": "https://www.linkedin.com/in/marko-wernig-20abbb48/",
    "Text": "Self made marketing expert, sales analyst and NLP coach, negotiation shark and business director with a wide range of successful past projects. Crypto trader, investor and product developer."
  },
  {
    "Team": "Team",
    "Name Surename": "Tomaz Jaklitsch",
    "Tittle": "Senior Strategist",
    "Linkedin": "https://www.linkedin.com/in/tomaz-jaklitsch-b018a427/",
    "Text": "More than 15 years of experience in the fields of business development, marketing, media and branding. He started his first creative group in 2001 and since then worked on creation and development of many successful brands, media solutions and public movements. He is also an adviser for foreign and domestic investors."
  },
  {
    "Team": "Team",
    "Name Surename": "Sandra Verdnik",
    "Tittle": "Data Analyst",
    "Linkedin": "https://www.linkedin.com/in/sandra-verdnik-5249a954/",
    "Text": "After graduating from University of Maribor, she started to work in the finance sector. After several years of working for a US company as a data analyst, she recently went back to the finance sector as a key client manager at an international bank."
  },
  {
    "Team": "Team",
    "Name Surename": "Igor Muzevic",
    "Tittle": "Medical Advisor & Senior Blockchain Strategist",
    "Linkedin": "https://www.linkedin.com/in/igor-muževič-990690b1/",
    "Text": "Investor and researcher of blockchain technology since 2013. Angel investor and external consultant to OriginTrail (First Purpose-built Protocol for Supply Chains Based on Blockchain). Founder and President of Trade Union of Slovenian Family doctors PRAKTIK.UM. Member of an Expert council in the field of Family medicine at Ministry of Health of Slovenia, representing the highest state expert body in the field of Family medicine."
  },
  {
    "Team": "Team",
    "Name Surename": "Urska Faller",
    "Tittle": "PR & PA",
    "Linkedin": "https://www.linkedin.com/in/urska-faller-59a185a/",
    "Text": "15 years of experience in communications and PR, public and private sector, diplomacy, politics and economy, content designer and project manager for projects supported with EU or other grants on field of tourism, nature, environment, smart communities and anthropological science."
  },
  {
    "Team": "Team",
    "Name Surename": "Tonja Gasperlin",
    "Tittle": "Lead Graphic Designer",
    "Linkedin": "https://www.linkedin.com/in/tonjagasperlin/",
    "Text": "Holding a Bachelor's degree from Faculty of Design, her skills flourished while studying in Barcelona, Spain. Designing everything from small projects to complete visual brand reinventions, Tonja believes in telling relatable stories through eye-watering graphics that are both impactful and at the same time easy on the eye."
  },
  {
    "Team": "Team",
    "Name Surename": "Oleg Batyrshin",
    "Tittle": "Creative Director",
    "Linkedin": "https://www.linkedin.com/in/oleg-batyrshin-31b1132a/",
    "Text": "Graphic designer with the ability to successfully convert desired moods and messages into imagery. With more than 15 years of experience in both print and digital media, he has a strong visual sense which applies in design for creating simple, beautiful and easy to understand concepts."
  },
  {
    "Team": "Team",
    "Name Surename": "Masa Krizman",
    "Tittle": "Social Media Editor",
    "Linkedin": "https://www.linkedin.com/in/ma%C5%A1a-kri%C5%BEman-b0920415a/",
    "Text": "A former Faculty of Design student, she has over 6 years experience  in the sales and marketing industry.  Used to micro and macro managing projects, creating social branding for companies from the ground up and implementing her ideas through visual communication and graphic design. A lover of challenging assignments where her knowledge can grow and evolve."
  },
  {
    "Team": "Team",
    "Name Surename": "Luka Lipar",
    "Tittle": "Senior Content Creator",
    "Linkedin": "https://www.linkedin.com/in/luka-lipar-75729815b/",
    "Text": "Creatively explaining how things work is his hobby. Add some enthusiasm for social networks, combine it with a deep insight of how people think and what do they want, and you get the perfect combination for creating content that is interesting to adults and understandable by children."
  },
  {
    "Team": "Team",
    "Name Surename": "Kaja Wernig",
    "Tittle": "Social Media Coordinator",
    "Linkedin": "https://www.linkedin.com/in/kajawernig/",
    "Text": "With more than 7 years of experience in sales, marketing and social media managment, her mind is always thinking of new and innovative ways to meet the needs of the costumer in areas and ways they havent even thought of. She is an expert in incorporating the soul and spirit of the best that humanity has to offer in all marketing and social campaigns.  "
  },
  {
    "Team": "Team",
    "Name Surename": "Namik Salievski",
    "Tittle": "Social Community Manager",
    "Linkedin": "https://www.linkedin.com/in/namik-salievski-57099415b/",
    "Text": "With his heavy work ethic and 8 years of experience in social marketing, web sales and online advertising, along with IT educational background, self-taught developer skills and profound interest in blockchain and crypto world, he is a perfect example of the go-to person in all matters where delicate and precise management of online communities is needed."
  },
  {
    "Team": "Team",
    "Name Surename": "Nino Serec",
    "Tittle": "Frontend Developer",
    "Linkedin": "https://www.linkedin.com/in/nino-serec-41b3b1157/",
    "Text": "The young and enthusiastic Nino has a strong foundation and experience in mobile app and web development. He is also intrigued by the progress of artificial intelligence and plans to continue his career and studies in this direction."
  },
  {
    "Team": "Team",
    "Name Surename": "Tristan Sneider",
    "Tittle": "Backend Developer",
    "Linkedin": "https://www.linkedin.com/in/tristan-šneider-66b859158/",
    "Text": "More than 4 years of experience in Web development and various programming languages, successfully launched different projects, currently developing Medicohealth Platform."
  },
  {
    "Team": "Team",
    "Name Surename": "Jure Pirc",
    "Tittle": "Chief Communications Officer",
    "Linkedin": "https://www.linkedin.com/in/internetnavarnost/",
    "Text": "IT professional with over 20 year of experience in information technologies. He is one of the most active cryptocurrency community managers in Slovenia and current president of Bitcoin association Slovenia."
  },
  {
    "Team": "Team",
    "Name Surename": "Romana Krejan",
    "Tittle": "Healthcare Business Development",
    "Linkedin": "https://www.linkedin.com/in/romana-krejan-9b935a15a/",
    "Text": "Romana Krejan gained her working experiences as a consultant for companies specialised in market entry. She has gained experience in 100+ researches and consulting projects in various sectors on European markets. She is an experienced moderator for in-depth interviews/ focus groups with 100+ researches done among physicians, pharmacist and end consumers."
  },
  {
    "Team": "Team",
    "Name Surename": "Janko Novak",
    "Tittle": "Key Account Manager Foreign Countries",
    "Linkedin": "https://www.linkedin.com/in/janko-novak-1793682a/",
    "Text": "Experienced Business Development Manager with a demonstrated history of working in the information technology and services industry. Skilled in Business Process, Intelligence Analysis, Legal Compliance, Electronic Payments, and Fraud Detection and Prevention."
  },
  {
    "Team": "Team",
    "Name Surename": "Eva Strus",
    "Tittle": "Digital Marketing Strategist",
    "Linkedin": "https://www.linkedin.com/in/evastrus/",
    "Text": "Eva is passionate about innovative digital communication strategies and inbound marketing with a track record of creating and implementing successful online marketing campaigns. She is proactive and self-directed person who is up-to-date with constantly evolving technologies and is committed to taking on challenging assignments."
  },
  {
    "Team": "Team",
    "Name Surename": "Navas Edilson",
    "Tittle": "Representative South and Latin America",
    "Linkedin": "https://www.linkedin.com/in/edilson-navas-694605110/",
    "Text": "He lives and works in Sao Paulo. Journalist and publicist, has worked last 25 years in prominent Brazilian advertising agencies such as RSVP, Jotacom and HSTK. He was recently appointed to Community Manager for Enlte's South America, a newly created decentralised social network. Since mid-2017 he is a blockchain tech enthusiast."
  },
  {
    "Team": "Team",
    "Name Surename": "Luka Podjed",
    "Tittle": "Head of Legal Department",
    "Linkedin": "https://www.linkedin.com/in/luka-podjed-370800a6/",
    "Text": "A professional legal expert specialized in the fields of commercial and penal law. Offering clients and partners a broad range of legal services required both by commercial entities in order to facilitate unhindered business operations as well as by natural persons for their personal concerns."
  },
  {
    "Team": "Team",
    "Name Surename": "Marusa Repnik",
    "Tittle": "Compliance Officer",
    "Linkedin": "https://www.linkedin.com/in/maruša-repnik-62176954/",
    "Text": "After getting her Bachelor's Degree in law, she collected her business experience working for various companies, helping them to set up their internal processes. Her latest challenge was working at cryptocurency Xaurum."
  },
  {
    "Team": "Team",
    "Name Surename": "Miha Mastnak",
    "Tittle": "Visual effects artist",
    "Linkedin": "https://www.linkedin.com/in/miha-mastnak-visual-effects/",
    "Text": "Visual effects artist with a Bachelor in Media Communications. Specialising in everything from Cinematic visual effects to Motion graphics."
  },
  {
    "Team": "Advisory Board",
    "Name Surename": "Dr. Henri Michael von Blanquet",
    "Tittle": "Medical Advisor",
    "Linkedin": "https://www.linkedin.com/in/dr-henri-michael-von-blanquet-m-d-mahm-20990454/",
    "Text": "He became an interim MD at the oncology private station at the Heinrich Heine University Dusseldorf. Then he became Director at the M & M AG, partner at the convergence office for system advice at the healthcare industry, Business Development and M&A Manager at the Marseille hospitals in Hamburg."
  },
  {
    "Team": "Advisory Board",
    "Name Surename": "Dr. Marko Bitenc",
    "Tittle": "Medical Advisor",
    "Linkedin": "https://www.linkedin.com/in/marko-bitenc-67718729/",
    "Text": "Has surgery license since 1993. He completed two mandates as the president of the Medical Chamber of Slovenia and was also president of the EFMA/WHO (European Forum of Medical Associations)."
  },
  {
	"Team": "Advisory Board",
	"Name Surename": "Vadim Balashov",
	"Tittle": "Financial Advisor",
	"Linkedin": "https://www.linkedin.com/in/vadim-balashov-7828335/",
	"Text": "25 years experience in cross-border transactions and management, EY Partner/Practice leader for Telecom and Technology. Advised technology companies from early stages to IPO. Specialized in business growth, corporate governance and finance. MD of GVA LaunchGurus Seed Fund."
  },
  {
    "Team": "Advisory Board",
    "Name Surename": "Dorijan Marusic",
    "Tittle": "Medical & Business Advisor",
    "Linkedin": "https://www.linkedin.com/in/dorjan-marusic-99738414/",
    "Text": "He became medical director of the General Hospital Izola in May 2000. At the end of the same year, he became State Secretary at the Ministry of Health of the Republic of Slovenia. In 2008 he becomes the advisor of the General Director of the Health Insurance Institute of Slovenia. He was Minister of Health in Republic of Slovenia for 2 years. He was member of the Expert Panel on Effective Ways of Investing in Health at DG SANCO until 2016."
  },
  {
    "Team": "Advisory Board",
    "Name Surename": "Simon Cocking",
    "Tittle": "Cryptocurrency Advisor",
    "Linkedin": "https://www.linkedin.com/in/simon-cocking-20540135/",
    "Text": "Senior Editor at Irish Tech News, Editor in Chief at CryptoCoinNews, also freelances for Sunday Business Post, Irish Times, Southern Star, IBM, G+D, and others. He is a top ranked member of the People of Blockchain (currently ranked at #1 / 18,000). He is also a business mentor and advisor working with 70+ successful ICOs to date."
  },
  {
    "Team": "Advisory Board",
    "Name Surename": "Dr. Dr. Philipp Plugmann",
    "Tittle": "Medical & Strategy Advisor",
    "Linkedin": "https://www.linkedin.com/in/dr-dr-philipp-plugmann-mba-msc-msc-95ba925/",
    "Text": "Member of Advisory Council of Innovation club AIF FTK GmbH, participant of a Part-Time DBA Programme, currently working on 2 books. Presented results of a multicentre study on the 12th and 14th International Open and User Innovation Conference, July 2014 and August 2016, Harvard Business School, Boston (USA), letter of acceptance by Prof Eric von Hippel and Nov 2015 in the 2nd World Open Innovation Conference, Silicon Valley, organized by Berkeley Haas School of Business."
  },
  {
    "Team": "Advisory Board",
    "Name Surename": "Prof. Dr. Thomas Jaeschke",
    "Tittle": "IT Development Advisor",
    "Linkedin": "https://www.linkedin.com/in/thomasjaeschke/",
    "Text": "He works as a medical and business information specialist. He teaches IT security as well as information and knowledge management at the FOM University of Economics and Management in Business Informatics."
  },
  {
    "Team": "Advisory Board",
    "Name Surename": "Prof. Dr. Hans Hermann Dirksen",
    "Tittle": "Legal Advisor",
    "Linkedin": "https://www.linkedin.com/in/prof-dr-hans-hermann-dirksen-97629733/",
    "Text": "Liebenstein law - Law Firm for Commercial Law & Medical Law, Christian-Albrechts-University Kiel, Frankfurt Main."
  },
  {
    "Team": "Advisory Board",
    "Name Surename": "Dumitru Fornea",
    "Tittle": "Advisor for European Affairs",
    "Linkedin": "https://www.linkedin.com/in/dumitru-fornea-33542a47/",
    "Text": "Member of the European Committee. International Relations, National Trade Union Confederation MERIDIAN (CSN MERIDIAN) & member of EESC, Eesc, University Politehnica of Bucharest, University of Buharest, SNSPA."
  },
  {
    "Team": "Advisory Board",
    "Name Surename": "Ulrich von Prittwitz",
    "Tittle": "Human Resource Development Advisor",
    "Linkedin": "https://www.linkedin.com/in/ulrich-von-prittwitz/",
    "Text": "He is the founder and CEO of Gaffron and Prittwitz. He also works as a recruitment consultant and specializes in systematic assessment and development."
  },
  {
    "Team": "Advisory Board",
    "Name Surename": "Aarne Kujala",
    "Tittle": "Executive MBA & MSc",
    "Linkedin": "https://www.linkedin.com/in/aarnekujala/",
    "Text": "Mr. Aarne Kujala has an extensive experience in field of pharmaceuticals, healthcare, consult- ing and finance. For the last two year Mr. Kujala managed a portfolio of respiratory and pulmonary medicines worth €55M in GlaxoSmithKline. Aarne’s passions include developing and innovating healthcare services as well as digital innovations serving patients better in a digitized modern society."
  },
  {
    "Team": "Advisory Board",
    "Name Surename": "Luka Pregelj",
    "Tittle": "Legal Advisors",
    "Linkedin": "https://www.linkedin.com/in/lukapregelj/",
    "Text": "A Legal and Business Consultant at Lex Lucas Consulting - lean consulting firm, advising on blockchain projects on the matters of corporate law, compliance, tax law, regulation of emerging technologies and global e-commerce. Luka has advised on a dozen blockchain projects as legal advisor and crowdsale manager (in case of imusify.com)."
  },
  {
    "Team": "Advisory Board",
    "Name Surename": "Ivo Grlica",
    "Tittle": "Legal Advisors",
    "Linkedin": "https://www.linkedin.com/in/ivo-grlica-4a378637/",
    "Text": "Blockchain legal specialist, involved in research on legal and tax challenges of cryptocurrencies and distributed ledger (blockchain) technologies. He has published numerous articles on legal aspects of innovative digital business models, smart contracts and smart law."
  },
  {
    "Team": "Advisory Board",
    "Name Surename": "Prof. Dr. Djordje Bajec",
    "Tittle": "Medical Advisor",
    "Linkedin": "http://www.belmedic.rs/tim/dorde-bajec-prof-dr-sci-med",
    "Text": "With more than 30 years of experience, and more then 20 years Leading Surgeon and CEO of Clinical Center of Serbia, Belgrade, the biggest government Hospital. Now, he is full time employed as Leading Surgeon and Medical Advisor to CEO in Bel Medic, leading private hospital in Serbia."
  },
  {
    "Team": "Advisory Board",
    "Name Surename": "Dr. Katarina Bajec",
    "Tittle": "Medical Advisor",
    "Linkedin": "https://www.zoominfo.com/p/Katarina-Bajec/-959509993",
    "Text": "With more than 10 years of experience in General Ophthalmology, specialized for anterior segment eye diseases, with special emphasys on diagnosis and treatment of keratoconus. She is founder and CEO at MediKat. Ltd, the first platform for Medical Business Intelligence, Innovations, Solutions, Strategy and Project Development."
  },
  {
    "Team": "Advisory Board",
    "Name Surename": "Dr. Boris Simoncic",
    "Tittle": "Medical Advisor",
    "Linkedin": "http://www.simed.si/Bibliografija/",
    "Text": "Dentist and Biotech entrepreneur, founder of Mirje Medical Center in Ljubljana, founder of Best Blood stem cells Therapy and Healthpassport."
  },
  {
    "Team": "Advisory Board",
    "Name Surename": "Sebastian Baum",
    "Tittle": "Healthcare Management Advisor",
    "Linkedin": "https://www.linkedin.com/in/krankenhaus/",
    "Text": "Since 2012 he is the commercial director of St. Antonius Hospital in Eschweiler. Before he gained experience as Head of Time Management at the University Hospital of Cologne as well as Consultant for Healthcare at the KPMG AG. He is lecturer in the field of Hospital Management at the FOM University and the mibeg Institute of Medicine. He is a member of the AK Economics in Health Care of the Schmalenbach Society."
  }
]
